# Вычислить число c заданной точностью d

a = float(input('Введите вещественное число: '))
d = int(input('Введите число для заданной точности числа: '))
print(round(a, d))